Enterprise_Serivces/Cert/SilverGroup2/SecurityService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/security/contracts/2010/05/ISecurityService/ValidateDevice</wsa:Action><wsa:MessageID>uuid:29e2f131-acdd-49ce-8381-349cf5c030b1</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://securityservicechannelqa1.testgs.pvt/SecurityService.svc</wsa:To></soap:Header><soap:Body><ValidateDevice xmlns="http://www.gamestop.com/services/channel/security/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><AuthorizationToken xmlns="http://www.gamestop.com/services/channel/security/messages/2014/05">f2e633aa-cea9-4b65-9d4b-1cbb27ed5bcc</AuthorizationToken><OpenIdClaimedIdentifier xmlns="http://www.gamestop.com/services/channel/security/messages/2014/05">/ID/091916134935357ujRr_2j00uyo7nAYb_52w</OpenIdClaimedIdentifier></request></ValidateDevice></soap:Body></soap:Envelope>